In [1]:
import pandas as pd

### Create A Sample DataFrame
We are passing a list of data points about bars & restaurants in San Francisco, then defining the column names

In [2]:
df = pd.DataFrame([('Foreign Cinema', 'Restaurant', 289.0),
                   ('Liho Liho', 'Restaurant', 224.0),
                   ('500 Club', 'bar', 80.5),
                   ('The Square', 'bar', 25.30)],
           columns=('name', 'type', 'AvgBill')
                 )
df

             name        type  AvgBill
0  Foreign Cinema  Restaurant    289.0
1       Liho Liho  Restaurant    224.0
2        500 Club         bar     80.5
3      The Square         bar     25.3

### Pop will do 2 things:
1. Remove the column from the data frame! - df.pop("your column name")
2. Return the column you're removing from the dataframe - "x = (your column returned)"

In [3]:
x = df.pop('type')

### The dataframe now has the column you popped removed

In [4]:
df

             name  AvgBill
0  Foreign Cinema    289.0
1       Liho Liho    224.0
2        500 Club     80.5
3      The Square     25.3

### And your popped column was returned as a pandas series

In [5]:
x

0    Restaurant
1    Restaurant
2           bar
3           bar
Name: type, dtype: object